In [3]:
import pandas as pd
Data=[
    {"Name":"Arun","DOB":"19/11/2007","Department":"CSE"},
    {"Name":"Balaji","DOB":"15/04/2008","Department":"CSE"},
    {"Name":"Cheenu","DOB":"19/3/2008","Department":"IT"},
    {"Name":"Eeshwar","DOB":"26/11/2007","Department":"ECE"}]
df=pd.DataFrame(Data)
df

      Name         DOB Department
0     Arun  19/11/2007        CSE
1   Balaji  15/04/2008        CSE
2   Cheenu   19/3/2008         IT
3  Eeshwar  26/11/2007        ECE

In [4]:
new_df=pd.DataFrame(Data, index=["S1","S2","S3","S4"])
new_df

       Name         DOB Department
S1     Arun  19/11/2007        CSE
S2   Balaji  15/04/2008        CSE
S3   Cheenu   19/3/2008         IT
S4  Eeshwar  26/11/2007        ECE